In [6]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

ModuleNotFoundError: No module named 'pandas'

In [1]:
import sys
!{sys.executable} -m pip install pandas numpy

Collecting pandas
  Using cached pandas-2.3.3-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy in c:\users\kry\appdata\local\programs\python\python313\lib\site-packages (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\kry\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\kry\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp313-cp313-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   ----- ---------------------------------- 1.6/11.0 MB 9.6 MB/s eta 0:00:01
   ------------ --------------------------- 3.4/11.0 MB 9.4 MB/s eta 0:00:01
   ------------------- -------------------- 5.2/11.0 MB 9.5 MB/s eta 0:00:01
   ---------------------------- ----------- 7.9/11.0 MB 10.2 MB/s eta 0:00:01
   ----------------------------------- ---- 9.7/11.0 MB 10.2 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 9.8 MB/s eta 0:00:00
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.3 pytz-2025.2 tzdata-2025.2

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  6  4  9  2  5
1  3  8  1  4  8
2  6  1  2  8  6
3  2  1  2  5  3
4  8  9  5  6  3

In [3]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [4]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        6        4        9        2        5
1        3        8        1        4        8
2        6        1        2        8        6
3        2        1        2        5        3
4        8        9        5        6        3

In [5]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        6        4        9        2        5
1        3        8        1        4        8
2        6        1        2        8        6
3        2        1        2        5        3
4        8        9        5        6        3

#02: Pemilihan baris (rows selection) pada Data Frame

In [6]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [ ]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns=cols)
df

In [7]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
1  3  8  1  4  8

In [8]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
1  3  8  1  4  8

In [9]:
df[~df['A'].isin([1, 3])]

   A  B  C  D  E
0  6  4  9  2  5
2  6  1  2  8  6
3  2  1  2  5  3
4  8  9  5  6  3

#03: Konversi tipe data String ke Numerik pada kolom Data Frame

In [10]:
import pandas as pd

print(pd.__version__)

2.3.3

In [11]:
data = {'col1':['1', '2', '3', 'teks'], 
        'col2':['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [12]:
df.dtypes

col1    object
col2    object
dtype: object

In [13]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [14]:
df_x.dtypes

col1    object
col2     int64
dtype: object

In [15]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4


#04: Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data

In [16]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [17]:
## DEPRICATED ##
# n_rows = 5
# n_cols = 2
# cols = ['bil_pecahan', 'bil_bulat']

# df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
#                   columns=cols)
# df['bil_pecahan'] = df['bil_pecahan'].astype('float')

# df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
# df = df.reset_index()

# df['teks'] = list('ABCDE')

# df

In [18]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2024-10-01', periods=n_rows, freq='h')

df = df.reset_index()
df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2024-10-01 00:00:00          4.0          9    A
1 2024-10-01 01:00:00         14.0          4    B
2 2024-10-01 02:00:00          6.0          1    C
3 2024-10-01 03:00:00          4.0          5    D
4 2024-10-01 04:00:00         18.0         10    E

In [19]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [20]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          4.0          9
1         14.0          4
2          6.0          1
3          4.0          5
4         18.0         10

In [21]:
df.select_dtypes(include='float')

   bil_pecahan
0          4.0
1         14.0
2          6.0
3          4.0
4         18.0

In [22]:
df.select_dtypes(include='int')

   bil_bulat
0          9
1          4
2          1
3          5
4         10

In [23]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [24]:
df.select_dtypes(include='datetime')

                index
0 2024-10-01 00:00:00
1 2024-10-01 01:00:00
2 2024-10-01 02:00:00
3 2024-10-01 03:00:00
4 2024-10-01 04:00:00

In [25]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0          4.0          9    A
1         14.0          4    B
2          6.0          1    C
3          4.0          5    D
4         18.0         10    E